; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v6 - type_3 ?v2 - type_2)
 	      (pred_4 ?v1 - object ?v2 - type_2)
	      (pred_3 ?v6 - type_3 ?v3 - type_1)
	      (pred_2 ?v6 - type_3 ?v1 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v6 - type_3 ?v8 ?v4 - type_2)
       :precondition (and  (pred_1 ?v6 ?v8))
       :effect (and  (pred_1 ?v6 ?v4)
		     (not (pred_1 ?v6 ?v8))))

   (:action op_2
       :parameters (?v6 - type_3 ?v5 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v7) (pred_1 ?v6 ?v7) (pred_3 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_3 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_3 ?v5 - object ?v7 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v5 ?v3) (pred_1 ?v6 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_3 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_03 obj_13 - type_3
obj_11 obj_10 obj_12 obj_07 - type_1
obj_09 obj_02 obj_04 obj_06 - type_2
obj_01 obj_05 obj_08 - object)
(:init
(pred_1 obj_03 obj_06)
(pred_3 obj_03 obj_11)
(pred_3 obj_03 obj_10)
(pred_1 obj_13 obj_04)
(pred_3 obj_13 obj_12)
(pred_3 obj_13 obj_07)
(pred_4 obj_01 obj_09)
(pred_4 obj_05 obj_09)
(pred_4 obj_08 obj_09)
)
(:goal
(and
(pred_4 obj_01 obj_04)
(pred_4 obj_05 obj_09)
(pred_4 obj_08 obj_02)
)
)

(:constraints
  (always (not (pred_1 obj_03 obj_04)))
)
)

; plan
1. (op_1 obj_03 obj_06 obj_02)
   deleted: (pred_1 obj_03 obj_06)
   added: (pred_1 obj_03 obj_02)
   goals met: 1 of 3
2. (op_1 obj_13 obj_04 obj_09)
   deleted: (pred_1 obj_13 obj_04)
   added: (pred_1 obj_13 obj_09)
   goals met: 1 of 3
3. (op_2 obj_13 obj_08 obj_09 obj_07)
   deleted: (pred_4 obj_08 obj_09) (pred_3 obj_13 obj_07)
   added: (pred_2 obj_13 obj_08 obj_07)
   goals met: 1 of 3
4. (op_2 obj_13 obj_01 obj_09 obj_12)
   deleted: (pred_4 obj_01 obj_09) (pred_3 obj_13 obj_12)
   added: (pred_2 obj_13 obj_01 obj_12)
   goals met: 1 of 3
5. (op_1 obj_13 obj_09 obj_02)
   deleted: (pred_1 obj_13 obj_09)
   added: (pred_1 obj_13 obj_02)
   goals met: 1 of 3
6. (op_3 obj_13 obj_08 obj_02 obj_07)
   deleted: (pred_2 obj_13 obj_08 obj_07)
   added: (pred_4 obj_08 obj_02) (pred_3 obj_13 obj_07)
   goals met: 2 of 3
7. (op_1 obj_13 obj_02 obj_04)
   deleted: (pred_1 obj_13 obj_02)
   added: (pred_1 obj_13 obj_04)
   goals met: 2 of 3
8. (op_3 obj_13 obj_01 obj_04 obj_12)
   deleted: (pred_2 obj_13 obj_01 obj_12)
   added: (pred_4 obj_01 obj_04) (pred_3 obj_13 obj_12)
   goals met: 3 of 3
